In [1]:
import pandas as pd

In [2]:
data = {
    'San Francisco': [7, 10, 11, 11, 12, 9, 8],
    'New York': [-14, -11, -9, -7, -13, -14, -15],
    'London': [5, 3, 8, 6, 1, -1, 2]
}

In [3]:
pd.DataFrame(data)

   London  New York  San Francisco
0       5       -14              7
1       3       -11             10
2       8        -9             11
3       6        -7             11
4       1       -13             12
5      -1       -14              9
6       2       -15              8

In [4]:
df = pd.DataFrame(data, index=['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'])
df

     London  New York  San Francisco
Mon       5       -14              7
Tue       3       -11             10
Wed       8        -9             11
Thu       6        -7             11
Fri       1       -13             12
Sat      -1       -14              9
Sun       2       -15              8

In [ ]:
df.info()

In [ ]:
df.describe()

### Indexing and selection

In [ ]:
df['San Francisco']

In [ ]:
df[['New York', 'San Francisco']]

In [ ]:
df.loc['Mon']

In [ ]:
df.loc['Mon': 'Wed']

In [ ]:
df.loc['Mon', ['New York', 'London']]

In [ ]:
df.loc[['Mon', 'Wed'], ['New York', 'London']]

In [ ]:
df.loc['Mon': 'Wed', ['New York', 'London']]

### Filtering / Conditional Selection
(works similar to Series)

In [5]:
df[df < 10]

     London  New York  San Francisco
Mon       5       -14            7.0
Tue       3       -11            NaN
Wed       8        -9            NaN
Thu       6        -7            NaN
Fri       1       -13            NaN
Sat      -1       -14            9.0
Sun       2       -15            8.0

In [6]:
df < 10

     London  New York  San Francisco
Mon    True      True           True
Tue    True      True          False
Wed    True      True          False
Thu    True      True          False
Fri    True      True          False
Sat    True      True           True
Sun    True      True           True

In [8]:
df[(df < 10) & (df >= -9)]

     London  New York  San Francisco
Mon       5       NaN            7.0
Tue       3       NaN            NaN
Wed       8      -9.0            NaN
Thu       6      -7.0            NaN
Fri       1       NaN            NaN
Sat      -1       NaN            9.0
Sun       2       NaN            8.0

In [9]:
(df < 10) & (df >= -9)

     London  New York  San Francisco
Mon    True     False           True
Tue    True     False          False
Wed    True      True          False
Thu    True      True          False
Fri    True     False          False
Sat    True     False           True
Sun    True     False           True

In [ ]:
df[df['San Francisco'] < 10]

In [ ]:
df.loc[(df['San Francisco'] < 10), 'San Francisco']

In [ ]:
df.loc[(df['San Francisco'] < 10), ['New York', 'San Francisco']]

### Dealing with missing data

In [ ]:
df.loc['Mon 2'] = [None, 3, None]
df.loc['Tue 2'] = [9, 7, None]

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1)

In [ ]:
df.fillna(999)

In [ ]:
df.fillna(method='ffill')